/*

Задача 3: Напишите программу, которая задаёт массив из
8 элементов случайными числами и выводит их на экран.
Оформите заполнение массива и вывод в виде функции
(пригодится в следующих задачах)

1,2,5,7,19,1,2,8 -> 1,2,5,7,19,1,2,8
6,1,33,5,6,7,7,1 -> 6,1,33,5,6,7,7,1

*/

void callArray()
{
    int[] array = new int[8];
    int j = 0;
    for(int i = 0; i < array.Length; i++)
    {
        array[j] = new Random().Next(0, 101);
        System.Console.Write($"{array[j]}  ");
    }
}

callArray();


